In [28]:
import pandas as pd

In [29]:

price = [1,2,3,4,5]
quantity = [5,6,7,8,9]

In [30]:
df = pd.DataFrame(price,columns=['Price'])

In [31]:
df.head()

   Price
0      1
1      2
2      3
3      4
4      5

In [32]:

df['quantity'] = quantity

In [33]:
df

   Price  quantity
0      1         5
1      2         6
2      3         7
3      4         8
4      5         9

In [36]:
df['total'] = df['Price']+df['quantity']

In [37]:
df

   Price  quantity  total
0      1         5      6
1      2         6      8
2      3         7     10
3      4         8     12
4      5         9     14

In [ ]:
# groupby use